tests/org.jboss.tools.teiid.ui.bot.test/resources/xml/WebServiceCreationTest/InsertRequest.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pro="http://www.metamatrix.com/ProductsInfo">
    <x:Header/>
    <x:Body>
        <pro:ProductsInfo_New_Input>
            <pro:ProductsInfo_New_Input_Instance>
                <pro:INSTR_ID>XXX1234</pro:INSTR_ID>
                <pro:SYMBOL_TYPE>1</pro:SYMBOL_TYPE>
                <pro:SYMBOL>TTT</pro:SYMBOL>
                <pro:NAME>Test Corp</pro:NAME>
                <pro:ISDJI>0</pro:ISDJI>
                <pro:ISSP500>0</pro:ISSP500>
                <pro:ISNAS100>0</pro:ISNAS100>
                <pro:ISAMEXINT>0</pro:ISAMEXINT>
            </pro:ProductsInfo_New_Input_Instance>
        </pro:ProductsInfo_New_Input>
    </x:Body>
</x:Envelope>